app/controllers/radi_ses_controller.rb

  def index
    @radi_ses = RadiSe.all
---
SELECT "radi_ses".* FROM "radi_ses"