app/controllers/todo_lists_controller.rb

  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("task_title", "task_description", "task_time", "difficulty_level", "created_at", "updated_at", "prioritet") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @todo_list.destroy
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = $1  [["id", 16]]