app/controllers/uradjenos_controller.rb

  def index
    @uradjenos = Uradjeno.all
---
SELECT "uradjenos".* FROM "uradjenos"